Ran Apply for project: `environments` dir: `environments/dev` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
running "terragrunt apply -auto-approve" in "/atlantis-data/repos/Jeevaann/terragrunt-multi-env-management/2/default/environments/dev": exit status 1: running "terragrunt apply -auto-approve" in "/atlantis-data/repos/Jeevaann/terragrunt-multi-env-management/2/default/environments/dev": 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Test-Dev-nat-eip"
        }
      + tags_all             = {
          + "Name" = "Test-Dev-nat-eip"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Test-Dev-igw"
        }
      + tags_all = {
          + "Name" = "Test-Dev-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Test-Dev-nat-gw"
        }
      + tags_all             = {
          + "Name" = "Test-Dev-nat-gw"
        }
    }

  # aws_route.private_nat will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_igw will be created
  + resource "aws_route" "public_igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_route will be created
  + resource "aws_route_table" "private_route" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Test-Dev-private-rt"
        }
      + tags_all         = {
          + "Name" = "Test-Dev-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_route will be created
  + resource "aws_route_table" "public_route" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Test-Dev-public-rt"
        }
      + tags_all         = {
          + "Name" = "Test-Dev-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_assoc[0] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_assoc[1] will be created
  + resource "aws_route_table_association" "private_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[0] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_assoc[1] will be created
  + resource "aws_route_table_association" "public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.default_group will be created
  + resource "aws_security_group" "default_group" {
      + arn                    = (known after apply)
      + description            = "Default Secuirty Group for EKS VPC Network"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Test-Dev-default-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Test-Dev-default-sg"
        }
      + tags_all               = {
          + "Name" = "Test-Dev-default-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.default_egress_rule will be created
  + resource "aws_security_group_rule" "default_egress_rule" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ing_http_rules will be created
  + resource "aws_security_group_rule" "ing_http_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.ing_ssh_rules will be created
  + resource "aws_security_group_rule" "ing_ssh_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_subnet.eks_private_subnets[0] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-private-subnet-ap-south-1a"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-private-subnet-ap-south-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_private_subnets[1] will be created
  + resource "aws_subnet" "eks_private_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-private-subnet-ap-south-1b"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-private-subnet-ap-south-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_public_subnets[0] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-public-subnet-ap-south-1a"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-public-subnet-ap-south-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_public_subnets[1] will be created
  + resource "aws_subnet" "eks_public_subnets" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Test-Dev-public-subnet-ap-south-1b"
        }
      + tags_all                                       = {
          + "Name" = "Test-Dev-public-subnet-ap-south-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be created
  + resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "Test-Dev-vpc"
        }
      + tags_all                             = {
          + "Name" = "Test-Dev-vpc"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.
aws_eip.nat_eip: Creating...
aws_vpc.eks_vpc: Creating...
aws_eip.nat_eip: Creation complete after 1s [id=eipalloc-01eeb0a9043b47347]
aws_vpc.eks_vpc: Still creating... [10s elapsed]
aws_vpc.eks_vpc: Creation complete after 12s [id=vpc-0dd6972bfe4c3b518]
aws_security_group.default_group: Creating...
aws_subnet.eks_private_subnets[0]: Creating...
aws_subnet.eks_public_subnets[1]: Creating...
aws_route_table.private_route: Creating...
aws_route_table.public_route: Creating...
aws_internet_gateway.igw: Creating...
aws_subnet.eks_public_subnets[0]: Creating...
aws_subnet.eks_private_subnets[1]: Creating...
aws_internet_gateway.igw: Creation complete after 1s [id=igw-0ce48bcfbdfd323b4]
aws_route_table.public_route: Creation complete after 1s [id=rtb-05dcc8880ea8e976c]
aws_route.public_igw: Creating...
aws_route_table.private_route: Creation complete after 1s [id=rtb-07b5fcc7598794d5d]
aws_route.public_igw: Creation complete after 0s [id=r-rtb-05dcc8880ea8e976c1080289494]
aws_security_group.default_group: Creation complete after 3s [id=sg-0d894644a9951d1e0]
aws_security_group_rule.ing_http_rules: Creating...
aws_security_group_rule.default_egress_rule: Creating...
aws_security_group_rule.ing_ssh_rules: Creating...
aws_security_group_rule.ing_http_rules: Creation complete after 1s [id=sgrule-2987789509]
aws_security_group_rule.default_egress_rule: Creation complete after 1s [id=sgrule-1400488733]
aws_security_group_rule.ing_ssh_rules: Creation complete after 2s [id=sgrule-77353328]
╷
│ Error: error creating EC2 Subnet: InvalidParameterValue: Value (ap-south-1b) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
│ 	status code: 400, request id: e79db99a-450d-4b9c-9252-6b94028d1070
│ 
│   with aws_subnet.eks_public_subnets[1],
│   on subnets.tf line 1, in resource "aws_subnet" "eks_public_subnets":
│    1: resource "aws_subnet" "eks_public_subnets" {
│ 
╵
╷
│ Error: error creating EC2 Subnet: InvalidParameterValue: Value (ap-south-1a) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
│ 	status code: 400, request id: e0eba635-1209-4051-8cb3-4097411a17a6
│ 
│   with aws_subnet.eks_public_subnets[0],
│   on subnets.tf line 1, in resource "aws_subnet" "eks_public_subnets":
│    1: resource "aws_subnet" "eks_public_subnets" {
│ 
╵
╷
│ Error: error creating EC2 Subnet: InvalidParameterValue: Value (ap-south-1b) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
│ 	status code: 400, request id: 16e66348-726f-4e97-b428-54aa5ffe0b41
│ 
│   with aws_subnet.eks_private_subnets[1],
│   on subnets.tf line 12, in resource "aws_subnet" "eks_private_subnets":
│   12: resource "aws_subnet" "eks_private_subnets" {
│ 
╵
╷
│ Error: error creating EC2 Subnet: InvalidParameterValue: Value (ap-south-1a) for parameter availabilityZone is invalid. Subnets can currently only be created in the following availability zones: us-east-1a, us-east-1b, us-east-1c, us-east-1d, us-east-1e, us-east-1f.
│ 	status code: 400, request id: e449ac70-74e2-46d7-8e34-eada9cd0aa5c
│ 
│   with aws_subnet.eks_private_subnets[0],
│   on subnets.tf line 12, in resource "aws_subnet" "eks_private_subnets":
│   12: resource "aws_subnet" "eks_private_subnets" {
│ 
╵
time=2023-01-04T08:45:01Z level=error msg=Terraform invocation failed in /atlantis-data/repos/Jeevaann/terragrunt-multi-env-management/2/default/environments/dev/.terragrunt-cache/Zw1aku4COJA3_y67MZsFOaHSH3M/ySbMDLSXeLDNml4IWqdW3bmP4jw/modules/vpc prefix=[/atlantis-data/repos/Jeevaann/terragrunt-multi-env-management/2/default/environments/dev] 
time=2023-01-04T08:45:01Z level=error msg=1 error occurred:
	* exit status 1




```
</details>

